/*************************************************************************
    > File Name: t1_8.cpp
    > Author: Amano Sei
    > Mail: amano_sei@outlook.com
    > Created Time: 2021年01月25日 星期一 19时55分43秒
 ************************************************************************/

#include <iostream>

int/*所以说所有放在可以放空白的地方的界定符都是界定符，反之不是。并且一对界定符及其内部的内容在g++中会被当作空白，这点还可以用-E验证*/main(){
    std::cout << "/*";
    std::cout << "*/";

    //std::cout << /* "*/" */;
    std::cout << /* "*/" */";

    std::cout << /* "*/" /* "/*" */;
    return 0;
}

